Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииОбъектов", Истина);
	Настройки.Обработчики.Вставить("ФормаПриСозданииНаСервере", Истина);
	
	Возврат Настройки;
КонецФункции

	Функция ФормаПриСозданииОбъектов(Форма, Отказ, МассивОписаний) Экспорт
		А1Интерфейс.А1БК_ГруппаСКолонками().ДобавитьОписание(МассивОписаний, "ГруппаОсновное", 2);
		А1Интерфейс_РабочийСтол.ДобавитьОписаниеКнопкиОткрытияФормы(МассивОписаний, "ОбщаяФорма.А1Интерфейс_ПерсональныеНастройки", "Персональные настройки", "ГруппаОсновное");
		
		А1Э_Механизмы.ВыполнитьМеханизмыОбработчика("А1Интерфейс_Настройки__ПриСозданииОбъектов", Форма, Отказ, МассивОписаний);
	КонецФункции
	
	Функция ФормаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		А1Э_Механизмы.ВыполнитьМеханизмыОбработчика("А1Интерфейс_Настройки__ПриСозданииНаСервере", Форма, Отказ, СтандартнаяОбработка);
	КонецФункции
