#Область Механизм

Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииЭлементов", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииЭлементов(Форма, Отказ, СтандартнаяОбработка) Экспорт
		МассивНастроек = Новый Массив;
		А1Э_Механизмы.ВыполнитьМеханизмыОбработчика("А1Интерфейс_ПриОпределенииСоставаПерсональныхНастроек", МассивНастроек);
		Для Каждого Настройка Из МассивНастроек Цикл
			
		КонецЦикла;
		
	КонецФункции 
	
#КонецЕсли

#КонецОбласти 

Функция НовыйОписаниеНастройки(Имя, Тип, Заголовок = Неопределено, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат А1Э_Структуры.Класс(
	"Класс", "А1Интерфейс_ОписаниеПерсональнойНастройки",
	"Имя", Имя,
	"Тип", А1Э_СтандартныеТипы.ОписаниеТиповПолучить(Тип),
	"Заголовок", Заголовок,
	"ЗначениеПоУмолчанию", ЗначениеПоУмолчанию,
	)	
КонецФункции 
 