
&После("УстановкаПараметровСеанса")
Процедура А1Интерфейс_УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если ТребуемыеПараметры = Неопределено Тогда 
		Если ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.А1Интерфейс_РабочийСтол) Тогда 
			НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
			СоставФорм = Новый СоставФормНачальнойСтраницы;
			СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.А1Интерфейс_РабочийСтол");
			НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
			ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
